       01  AREA-RESPOSTA-CONSULTA.
           05 RESP-CONS-STATUS            PIC X(01). 
           05 RESP-CONS-CODIGO-CLIENTE    PIC 9(06).
           05 RESP-CONS-NOME-CLIENTE      PIC X(30).
           05 RESP-CONS-TELEFONE          PIC X(15).
           05 RESP-CONS-EMAIL             PIC X(40).
           05 RESP-CONS-MENSAGEM          PIC X(50).
